# 常用：分组汇总

In [3]:
sample = pd.read_csv('./sample.csv', encoding='gbk')
sample

   chinese  class  grade  math   name
0       88      1      1  98.0    Bob
1       78      1      1  78.0  Lindy
2       86      1      1  87.0   Mark
3       56      2      2  77.0   Miki
4       77      1      2  77.0  Sully
5       54      2      2   NaN   Rose

In [4]:
sample.head()

   chinese  class  grade  math   name
0       88      1      1  98.0    Bob
1       78      1      1  78.0  Lindy
2       86      1      1  87.0   Mark
3       56      2      2  77.0   Miki
4       77      1      2  77.0  Sully

In [5]:
sample.groupby('class') [['math']].max()

       math
class
1      98.0
2      77.0

In [6]:
sample.groupby('class') ['math'].max()

class
1    98.0
2    77.0
Name: math, dtype: float64

In [8]:
sample.groupby('class').max()

       chinese  grade  math   name
class
1           88      2  98.0  Sully
2           56      2  77.0   Rose

In [9]:
sample.groupby(['grade','class'])[['math']].mean()

                  math
grade class
1     1      87.666667
2     1      77.000000
      2      77.000000

In [10]:
sample.groupby(['grade'])['math','chinese'].mean()

            math    chinese
grade
1      87.666667  84.000000
2      77.000000  62.333333

In [11]:
sample.groupby('class')['math'].agg(['mean','min','max'])

       mean   min   max
class
1      85.0  77.0  98.0
2      77.0  77.0  77.0

In [12]:
df = sample.groupby(['grade', 'class'])['math', 'chinese'].agg(['min', 'max'])
df

             math       chinese
              min   max     min max
grade class
1     1      78.0  98.0      78  88
2     1      77.0  77.0      77  77
      2      77.0  77.0      54  56